In [2]:

import pandas as pd
import numpy as np
var = pd.DataFrame({"A":[1, 2, 3, 4], "B":[5, 6,7, 8]})
var

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [84]:
# make a new df with city and state data

person = pd.DataFrame({"personid":[1, 2], "lastName":["Wang", "Alice"], "firstName":["Allen", "Bob"]})
Address = pd.DataFrame({"addressId":[1, 2], "personid":[2, 3], "City":["new_york city", "leetcode"], "state":["New York", "California"]})
# df = pd.DataFrame()
# df.insert(0, "firstName", person["firstName"])
# df.insert(1, "lastName", person["lastName"])
# # person = person.merge(Address, how='left')
# # person = person.replace(to_replace=np.nan, value=None)
# df = pd.concat([df, person["City"]], axis=1)
# df = pd.concat([df, person["state"]], axis=1)

# or 
p = pd.merge(left=person, right=Address, how='left', on='personid')[['firstName', 'lastName', 'City', 'state']]
p

  firstName lastName           City     state
0     Allen     Wang            NaN       NaN
1       Bob    Alice  new_york city  New York

In [6]:
# Qu 2 - find workers with more salary then his boss
data = {'id':[1,2,3,4],
        'Name': ['John', 'Mary', 'Peter', 'David'],
        'Salary': [70000, 80000, 60000, 90000],
        'managerid':[3, 4, None, None]
        }
df = pd.DataFrame(data)
# print(df['Salary'] > df[df['managerid']])

In [9]:
data2 = df
data2.insert(4, "bonus", data2['Salary']*2)
data2

   id   Name  Salary  managerid   bonus
0   1   John   70000        3.0  140000
1   2   Mary   80000        4.0  160000
2   3  Peter   60000        NaN  120000
3   4  David   90000        NaN  180000

In [3]:
dff = pd.DataFrame({"id":[1, 2, 3], "email":["a@gmail.com", "b@gmail.com", "a@gmail.com"]})
result_df = dff.loc[dff.duplicated(subset=['email']), ['email']]
result_df.drop_duplicates()

         email
2  a@gmail.com

In [4]:
ll = [[1, 15], [2, 13], [3, 14], [4, 16]]
df = pd.DataFrame(ll, columns=["Student_id", "Age"])
df

   Student_id  Age
0           1   15
1           2   13
2           3   14
3           4   16

In [5]:
dff['email'].str[len]

0   NaN
1   NaN
2   NaN
Name: email, dtype: float64

In [12]:
dfs = pd.DataFrame({'project_id':[1, 1, 1, 2, 2], 'employee_id':[1, 2, 3, 1, 4]})
dfs = dfs.pivot(columns= 'project_id', values='employee_id')

TypeError: 'int' object is not iterable